In [1]:
import numpy as np          # type: ignore
import pandas as pd         # type: ignore

## üõ†Ô∏è Handling Missing Values: `isnull()` & `notnull()`

### üîç Detecting Missing Data  
| Method        | Description                                      |
|--------------|--------------------------------------------------|
| `isnull()`   | ‚úÖ Returns `True` for **missing (NaN)** values   |
| `notnull()`  | ‚úÖ Returns `True` for **non-missing** values     |

### üí° **Usage Examples**  
```python
df.isnull()             # Detect missing values in each cell
df.notnull()            # Detect non-missing values in each cell
df[df["col"].isnull()]  # Filter rows where a specific column has missing values

```
### ü§î Why Use This?
* Helps in **data cleaning before analysis**.
* Essential for **handling incomplete datasets**.
* Allows for better preprocessing strategies.

In [2]:
my_dict = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
states  = ['California', 'Ohio', 'Oregon', 'Texas']

obj4 = pd.Series(my_dict, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [3]:
print(pd.isnull(obj4))
print("============")
print(pd.notnull(obj4))

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool
============
California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

<div style="width: 100%; height: 10px; background: linear-gradient(to right, orange, red, orange, red, orange); border-radius: 5px; margin: 20px 0;"></div>

## üóëÔ∏è **Deleting Data in Pandas**  

### üî• Removing Unwanted Data  
| Method       | Description                                        |
|-------------|----------------------------------------------------|
| `del`       | ‚ùå Deletes a **specific column** from a DataFrame   |
| `drop()`    | üöÄ Deletes rows or columns by **labels**           |
| `dropna()`  | üõ†Ô∏è Removes rows/columns with **missing values**    |

### üí° **Usage Examples**  
```python
# Delete a column using del
del df["column_name"]

# Drop a column
df = df.drop("column_name", axis=1)  

# Drop a row
df = df.drop(index=5)  

# Remove missing values
df = df.dropna()

<h1 align="center"><strong></strong></h1>
<div style="background-color:rgb(255, 255, 255) ; color:rgb(46, 40, 40); width: 100%; height: 50px; text-align: center; font-weight: bold; line-height: 50px; margin: 10px 0; font-size: 24px;">
1Ô∏è‚É£ del
</div>

In [4]:
row = ['one', 'two', 'three', 'four', 'five', 'six']
col = ['year', 'state', 'pop', 'debt']
data1= {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year' : [2000, 2001, 2002, 2001, 2002, 2003],
        'pop'  : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data1, columns=col ,index=row)
frame['eastern'] = (frame.state == 'Ohio')
frame

       year   state  pop debt  eastern
one    2000    Ohio  1.5  NaN     True
two    2001    Ohio  1.7  NaN     True
three  2002    Ohio  3.6  NaN     True
four   2001  Nevada  2.4  NaN    False
five   2002  Nevada  2.9  NaN    False
six    2003  Nevada  3.2  NaN    False

In [5]:
del frame['eastern']   
frame

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

<h1 align="center"><strong></strong></h1>
<div style="background-color:rgb(255, 255, 255) ; color:rgb(46, 40, 40); width: 100%; height: 50px; text-align: center; font-weight: bold; line-height: 50px; margin: 10px 0; font-size: 24px;">
2Ô∏è‚É£ drop
</div>

> ### A. **Dropping in Series**

In [7]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
print(obj)
print("==========")
obj=obj.drop("c")
print(obj)
print("==========")
obj=obj.drop(["a","e"])
print(obj)

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64
==========
a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64
==========
b    1.0
d    3.0
dtype: float64

> ### B. **Dropping in DataFrame**

In [8]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
        index=['Ohio', 'Colorado', 'Utah', 'New York'],
        columns=['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [9]:
# row >>
data= data.drop(["Colorado","Utah"])    # = data.drop(["Colorado","Utah"],axis=0)     
data

          one  two  three  four
Ohio        0    1      2     3
New York   12   13     14    15

In [10]:
# col >>
data= data.drop(["one","three"],axis=1)         
data

          two  four
Ohio        1     3
New York   13    15

> ### C. **inplace**

In [11]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
        index=['Ohio', 'Colorado', 'Utah', 'New York'],
        columns=['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [12]:
data.drop(["Colorado","Utah"],inplace=False)

          one  two  three  four
Ohio        0    1      2     3
New York   12   13     14    15

In [13]:
data.drop(["Colorado","Utah"],inplace=False)
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [14]:
# Drop rows with index "Colorado" and "Utah" from the DataFrame
data.drop(["Colorado","Utah"],inplace=True)
data

          one  two  three  four
Ohio        0    1      2     3
New York   12   13     14    15

-------
## üéØ **Drop vs. Inplace ‚Äì What's the Difference?**  

### ‚öñÔ∏è **Key Differences**  

| Feature      | `drop()` ‚úÖ  | `inplace=True` ‚ùå |
|-------------|------------|------------------|
| Can store result in a variable? | ‚úÖ Yes | ‚ùå No |
| Can be used inside `print()`? | ‚úÖ Yes | ‚ùå No |
| Modifies original DataFrame? | ‚ùå No (creates a new one) | ‚úÖ Yes (modifies in place) |

### üöÄ **Examples**  

```python
# Using drop() (returns a new DataFrame)
df_new = df.drop("column_name", axis=1)
print(df_new)   # ‚úÖ Works fine!

# Using inplace=True (modifies original DataFrame)
df.drop("column_name", axis=1, inplace=True)
print(df)       # ‚úÖ Works, but df is already modified!

In [16]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
        index=['Ohio', 'Colorado', 'Utah', 'New York'],
        columns=['one', 'two', 'three', 'four'])

In [18]:
## Drop

print(f"data before : \n{data}")
print("========================") 
print(f"During operation : \n{data.drop(['Colorado','Utah'])}") 
print("========================") 
print(f"data after : \n{data}") 
print("========================") 

x = data.drop(["Ohio"])      
print(x)

data before :
          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15
========================
During operation :
          one  two  three  four
Ohio        0    1      2     3
New York   12   13     14    15
========================
data after :
          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15
========================
          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [19]:
## inplace

print(f"data before : \n{data}")
print("========================") 
print("During operation :") 
print("========================") 
print(data.drop(["Colorado","Utah"],inplace=True))     # None
print("========================")
print(f"data after : \n{data}") 
print("========================") 

x = data.drop(["Ohio"])      
print(x)              

# Z = data.drop(["Ohio"],inplace=True)
# print(Z)        # None

data before :
          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15
========================
During operation :
========================
None
========================
data after :
          one  two  three  four
Ohio        0    1      2     3
New York   12   13     14    15
========================
          one  two  three  four
New York   12   13     14    15